{"sha": "229c3ef1c37d88ea66d2e37b8de940f7b73315fb", "log": "Remove non-ascii quotes.  R=zhuyi DELTA=7  (0 added, 0 deleted, 7 changed)   Revision created by MOE tool push_codebase. MOE_MIGRATION=1095   ", "commit": "\n--- a/src/com/google/debugging/sourcemap/SourceMapGeneratorV2.java\n+++ b/src/com/google/debugging/sourcemap/SourceMapGeneratorV2.java\n    *\n    * 1.  {\n    * 2.    version: 2,\n-   * 3.    file: “out.js”\n+   * 3.    file: \"out.js\"\n    * 4.    lineCount: 2\n    * 5.    lineMaps: [\n    * 6.        \"ABAAA\",\n    * Line 2: File revision (always the first entry in the object)\n    * Line 3: The name of the file that this source map is associated with.\n    * Line 4: The number of lines represented in the sourcemap.\n-   * Line 5: “lineMaps” field is a JSON array, where each entry represents a\n+   * Line 5: \"lineMaps\" field is a JSON array, where each entry represents a\n    *     line in the generated text.\n    * Line 6: A line entry, representing a series of line segments, where each\n    *     segment encodes an mappings-id and repetition count.\n    * Line 9: An optional source root, useful for relocating source files on a\n-   *     server or removing repeated prefix values in the “sources” entry.\n-   * Line 10: A list of sources used by the “mappings” entry relative to the\n+   *     server or removing repeated prefix values in the \"sources\" entry.\n+   * Line 10: A list of sources used by the \"mappings\" entry relative to the\n    *     sourceRoot.\n-   * Line 11: A list of symbol names used by the “mapping” entry.  This list\n+   * Line 11: A list of symbol names used by the \"mapping\" entry.  This list\n    *     may be incomplete.\n    * Line 12: The mappings field.\n    * Line 13: Each entry represent a block of text in the original source, and\n    *     The line in the source file the text begins\n    *     The column in the line that the text begins\n    *     An optional name (from the original source) that this entry represents.\n-   *     This can either be an string or index into the “names” field.\n+   *     This can either be an string or index into the \"names\" field.\n    */\n   public void appendTo(Appendable out, String name) throws IOException {\n     int maxLine = prepMappings();\n--- a/src/com/google/javascript/jscomp/SideEffectsAnalysis.java\n+++ b/src/com/google/javascript/jscomp/SideEffectsAnalysis.java\n  * See:\n  *\n  * Banning, John. “An efficient way to find the side effects of procedure\n- *      calls and the aliases of variables.” POPL ‘79.\n+ *      calls and the aliases of variables.” POPL '79.\n  *\n  * For an introduction to MOD and REF sets.\n  *", "timestamp": 1301336915, "metainfo": ""}