{"sha": "94a4db4fef14db8f1b92dc5191cbdd8c2c1b2101", "log": "Misspelling in comments 'hexidecimal' -> 'hexadecimal'  ", "commit": "\n--- a/src/java/org/apache/commons/codec/binary/Hex.java\n+++ b/src/java/org/apache/commons/codec/binary/Hex.java\n     };\n \n     /**\n-     * Converts an array of characters representing hexidecimal values into an\n+     * Converts an array of characters representing hexadecimal values into an\n      * array of bytes of those same values. The returned array will be half the\n      * length of the passed array, as it takes two characters to represent any\n      * given byte. An exception is thrown if the passed char array has an odd\n      * number of elements.\n      * \n-     * @param data An array of characters containing hexidecimal digits\n+     * @param data An array of characters containing hexadecimal digits\n      * @return A byte array containing binary data decoded from\n      *         the supplied char array.\n      * @throws DecoderException Thrown if an odd number or illegal of characters \n     }\n \n     /**\n-     * Converts an array of bytes into an array of characters representing the hexidecimal values of each byte in order.\n+     * Converts an array of bytes into an array of characters representing the hexadecimal values of each byte in order.\n      * The returned array will be double the length of the passed array, as it takes two characters to represent any\n      * given byte.\n      * \n      * @param data\n      *                  a byte[] to convert to Hex characters\n-     * @return A char[] containing hexidecimal characters\n+     * @return A char[] containing hexadecimal characters\n      */\n     public static char[] encodeHex(byte[] data) {\n \n     }\n \n     /**\n-     * Converts an array of character bytes representing hexidecimal values into an\n+     * Converts an array of character bytes representing hexadecimal values into an\n      * array of bytes of those same values. The returned array will be half the\n      * length of the passed array, as it takes two characters to represent any\n      * given byte. An exception is thrown if the passed char array has an odd\n      * number of elements.\n      * \n-     * @param array An array of character bytes containing hexidecimal digits\n+     * @param array An array of character bytes containing hexadecimal digits\n      * @return A byte array containing binary data decoded from\n      *         the supplied byte array (representing characters).\n      * @throws DecoderException Thrown if an odd number of characters is supplied\n     }\n     \n     /**\n-     * Converts a String or an array of character bytes representing hexidecimal values into an\n+     * Converts a String or an array of character bytes representing hexadecimal values into an\n      * array of bytes of those same values. The returned array will be half the\n      * length of the passed String or array, as it takes two characters to represent any\n      * given byte. An exception is thrown if the passed char array has an odd\n      * number of elements.\n      * \n-     * @param object A String or, an array of character bytes containing hexidecimal digits\n+     * @param object A String or, an array of character bytes containing hexadecimal digits\n      * @return A byte array containing binary data decoded from\n      *         the supplied byte array (representing characters).\n      * @throws DecoderException Thrown if an odd number of characters is supplied\n \n     /**\n      * Converts an array of bytes into an array of bytes for the characters representing the\n-     * hexidecimal values of each byte in order. The returned array will be\n+     * hexadecimal values of each byte in order. The returned array will be\n      * double the length of the passed array, as it takes two characters to\n      * represent any given byte.\n      *\n      * @param array a byte[] to convert to Hex characters\n-     * @return A byte[] containing the bytes of the hexidecimal characters\n+     * @return A byte[] containing the bytes of the hexadecimal characters\n      * @see #encodeHex(byte[])\n      */\n     public byte[] encode(byte[] array) {\n \n     /**\n      * Converts a String or an array of bytes into an array of characters representing the\n-     * hexidecimal values of each byte in order. The returned array will be\n+     * hexadecimal values of each byte in order. The returned array will be\n      * double the length of the passed String or array, as it takes two characters to\n      * represent any given byte.\n      *\n      * @param object a String, or byte[] to convert to Hex characters\n-     * @return A char[] containing hexidecimal characters\n+     * @return A char[] containing hexadecimal characters\n      * @throws EncoderException Thrown if the given object is not a String or byte[]\n      * @see #encodeHex(byte[])\n      */", "timestamp": 1232483722, "metainfo": ""}