{"sha": "f76a8f917f5e4de8ba5abafa98a3c4f615be0e42", "log": "Minor changes to comply with Checkstyle requirements.  ", "commit": "\n--- a/src/main/java/org/apache/commons/math/util/IterationManager.java\n+++ b/src/main/java/org/apache/commons/math/util/IterationManager.java\n /*\n  * Licensed to the Apache Software Foundation (ASF) under one or more\n- * contributor license agreements. See the NOTICE file distributed with\n+ * contributor license agreements.  See the NOTICE file distributed with\n  * this work for additional information regarding copyright ownership.\n  * The ASF licenses this file to You under the Apache License, Version 2.0\n  * (the \"License\"); you may not use this file except in compliance with\n- * the License. You may obtain a copy of the License at\n+ * the License.  You may obtain a copy of the License at\n  *\n- * http://www.apache.org/licenses/LICENSE-2.0\n+ *      http://www.apache.org/licenses/LICENSE-2.0\n  *\n  * Unless required by applicable law or agreed to in writing, software\n  * distributed under the License is distributed on an \"AS IS\" BASIS,\n import java.util.Collection;\n import java.util.concurrent.CopyOnWriteArrayList;\n \n+import org.apache.commons.math.exception.MaxCountExceededException;\n+\n /**\n  * This abstract class provides a general framework for managing iterative\n  * algorithms. The maximum number of iterations can be set, and methods are\n  * @version $Id$\n  */\n public class IterationManager {\n+\n     /** Keeps a count of the number of iterations. */\n     private final Incrementor iterations;\n \n      * maximum number of iterations is reached. This method should be called at\n      * the beginning of a new iteration.\n      *\n-     * @throws MaxCountExceededException if the maximum number of iterations\n-     * is reached.\n+     * @throws MaxCountExceededException if the maximum number of iterations is\n+     * reached.\n      */\n-    public void incrementIterationCount() {\n+    public void incrementIterationCount()\n+        throws MaxCountExceededException {\n         iterations.incrementCount();\n     }\n ", "timestamp": 1316097994, "metainfo": ""}