{"sha": "4e2042fae407224a08d01d21e9b9ce2279a44db1", "log": "Better Javadoc for DateTimeComparator  See #73", "commit": "\n--- a/src/main/java/org/joda/time/DateTimeComparator.java\n+++ b/src/main/java/org/joda/time/DateTimeComparator.java\n     /**\n      * Returns a DateTimeComparator with a lower limit only. Fields of a\n      * magnitude less than the lower limit are excluded from comparisons.\n+     * <p>\n+     * The time-zone is considered when using this comparator.\n+     * The input millis are truncated using the time-zone of that input value.\n+     * Thus, two inputs with different time-zones will typically not be equal\n      *\n      * @param lowerLimit  inclusive lower limit for fields to be compared, null means no limit\n      * @return a comparator over all fields above the lower limit\n      * Fields of a magnitude greater than or equal to the upper limit are also\n      * excluded from comparisons. Either limit may be specified as null, which\n      * indicates an unbounded limit.\n+     * <p>\n+     * The time-zone is considered when using this comparator unless both limits are null.\n+     * The input millis are rounded/truncated using the time-zone of that input value.\n+     * Thus, two inputs with different time-zones will typically not be equal\n      *\n      * @param lowerLimit  inclusive lower limit for fields to be compared, null means no limit\n      * @param upperLimit  exclusive upper limit for fields to be compared, null means no limit\n     /**\n      * Returns a comparator that only considers date fields.\n      * Time of day is ignored.\n+     * <p>\n+     * The time-zone is considered when using this comparator.\n+     * The input millis are rounded down to the start of the day\n+     * in the time-zone of that input value. Thus, two inputs with\n+     * different time-zones will typically not be equal\n      * \n      * @return a comparator over all date fields\n      */\n     /**\n      * Returns a comparator that only considers time fields.\n      * Date is ignored.\n+     * <p>\n+     * The time-zone is considered when using this comparator.\n+     * The input millis are truncated to be within the day\n+     * in the time-zone of that input value. Thus, two inputs with\n+     * different time-zones will typically not be equal\n      * \n      * @return a comparator over all time fields\n      */", "timestamp": 1380936105, "metainfo": ""}