{"sha": "ae0e03f4a21b08f413807b51c8ba4c60ea5bb085", "log": "Improve javadoc about the reader/writer  ", "commit": "\n--- a/src/java/org/apache/commons/lang/text/StrBuilder.java\n+++ b/src/java/org/apache/commons/lang/text/StrBuilder.java\n      * To use, simply create a <code>StrBuilder</code>, populate it with\n      * data, call <code>asReader</code>, and then read away.\n      * <p>\n-     * Note that the internal character array is shared between the two\n-     * objects and no synchronization occurs, so you must not alter this\n-     * builder in one thread while reading it in another thread.\n-     * Note also that close has no effect on the reader, and that\n-     * marking is supported.\n+     * The internal character array is shared between the builder and the reader.\n+     * This allows you to append to the builder after creating the reader,\n+     * and the changes will be picked up.\n+     * Note however, that no synchronization occurs, so you must perform\n+     * all operations with the builder and the reader in one thread.\n+     * <p>\n+     * The returned reader supports marking, and ignores the flush method.\n      *\n      * @return a reader that reads from this builder\n      */\n      * call <code>asWriter</code>, and populate away. The data is available\n      * at any time using the methods of the <code>StrBuilder</code>.\n      * <p>\n-     * Note that the internal character array is shared between the two\n-     * objects and no synchronization occurs, so you must not alter this\n-     * the builder from one thread while writing in another thread.\n-     * Note also that close and flush have no effect on the writer.\n+     * The internal character array is shared between the builder and the writer.\n+     * This allows you to intermix calls that append to the builder and\n+     * write using the writer and the changes will be occur correctly.\n+     * Note however, that no synchronization occurs, so you must perform\n+     * all operations with the builder and the writer in one thread.\n+     * <p>\n+     * The returned writer ignores the close and flush methods.\n      *\n      * @return a writer that populates this builder\n      */", "timestamp": 1124546770, "metainfo": ""}