{"sha": "ddd50d2773c7126e0c3249c99bbed04cf7544b34", "log": "Fix DateTimeFormat javadoc to explain time zone parsing restriction better [OpenDiscussion 1721909]  ", "commit": "\n--- a/JodaTime/src/java/org/joda/time/format/DateTimeFormat.java\n+++ b/JodaTime/src/java/org/joda/time/format/DateTimeFormat.java\n  * This class provides two types of factory:\n  * <ul>\n  * <li>{@link #forPattern(String) Pattern} provides a DateTimeFormatter based on\n- * a pattern string that is compatible with the JDK date patterns.\n+ * a pattern string that is mostly compatible with the JDK date patterns.\n  * <li>{@link #forStyle(String) Style} provides a DateTimeFormatter based on a\n  * two character style, representing short, medium, long and full.\n  * </ul>\n  * String str = fmt.print(dt);\n  * </pre>\n  *\n- * The pattern syntax is compatible with java.text.SimpleDateFormat, but a few\n- * more symbols are also supported. All ASCII letters are reserved as pattern\n- * letters, which are defined as the following:\n+ * The pattern syntax is mostly compatible with java.text.SimpleDateFormat -\n+ * time zone names cannot be parsed and a few more symbols are supported.\n+ * All ASCII letters are reserved as pattern letters, which are defined as follows:\n  * <blockquote>\n  * <pre>\n  * Symbol  Meaning                      Presentation  Examples\n  * <p>\n  * <strong>Zone</strong>: 'Z' outputs offset without a colon, 'ZZ' outputs\n  * the offset with a colon, 'ZZZ' or more outputs the zone id.\n+ * <p>\n+ * <strong>Zone names</strong>: Time zone names ('z') cannot be parsed.\n  * <p>\n  * Any characters in the pattern that are not in the ranges of ['a'..'z']\n  * and ['A'..'Z'] will be treated as quoted text. For instance, characters\n     //-----------------------------------------------------------------------\n     /**\n      * Factory to create a formatter from a pattern string.\n-     * The pattern string is described above, and is similar to SimpleDateFormat.\n+     * The pattern string is described above in the class level javadoc.\n+     * It is very similar to SimpleDateFormat patterns.\n      * <p>\n      * The format may contain locale specific output, and this will change as\n      * you change the locale of the formatter.", "timestamp": 1180183540, "metainfo": ""}