{"sha": "30748db1e25c90bb37a5a97a0cae3cb3869c5c1a", "log": "Fix typos.  ", "commit": "\n--- a/src/main/java/org/apache/commons/collections/MultiMap.java\n+++ b/src/main/java/org/apache/commons/collections/MultiMap.java\n      * Other values attached to that key are unaffected.\n      * <p>\n      * If the last value for a key is removed, implementations typically\n-     * return <code>null</code> from a subsequant <code>get(Object)</code>, however\n+     * return <code>null</code> from a subsequent <code>get(Object)</code>, however\n      * they may choose to return an empty collection.\n      * \n      * @param key  the key to remove from\n      * Gets the number of keys in this map.\n      * <p>\n      * Implementations typically return only the count of keys in the map\n-     * This cannot be mandated due to backwards compatability of this interface.\n+     * This cannot be mandated due to backwards compatibility of this interface.\n      *\n      * @return the number of key-collection mappings in this map\n      */\n      * Checks whether the map contains the value specified.\n      * <p>\n      * Implementations typically check all collections against all keys for the value.\n-     * This cannot be mandated due to backwards compatability of this interface.\n+     * This cannot be mandated due to backwards compatibility of this interface.\n      *\n      * @param value  the value to search for\n      * @return true if the map contains the value\n     /**\n      * Removes all values associated with the specified key.\n      * <p>\n-     * Implementations typically return <code>null</code> from a subsequant\n+     * Implementations typically return <code>null</code> from a subsequent\n      * <code>get(Object)</code>, however they may choose to return an empty collection.\n      *\n      * @param key  the key to remove values from\n     /**\n      * Gets a collection containing all the values in the map.\n      * <p>\n-     * Inplementations typically return a collection containing the combination\n+     * Implementations typically return a collection containing the combination\n      * of values from all keys.\n-     * This cannot be mandated due to backwards compatability of this interface.\n+     * This cannot be mandated due to backwards compatibility of this interface.\n      *\n      * @return a collection view of the values contained in this map\n      */", "timestamp": 1363551015, "metainfo": ""}