{"sha": "763866ccfee48965b78a3fce56100b0b204a4826", "log": "MATH-792: created a visitor for vectors. Entries of the vector being visited are not modified.  ", "commit": "\n--- /dev/null\n+++ b/src/main/java/org/apache/commons/math3/linear/RealVectorPreservingVisitor.java\n+/*\n+ * Licensed to the Apache Software Foundation (ASF) under one or more\n+ * contributor license agreements.  See the NOTICE file distributed with\n+ * this work for additional information regarding copyright ownership.\n+ * The ASF licenses this file to You under the Apache License, Version 2.0\n+ * (the \"License\"); you may not use this file except in compliance with\n+ * the License.  You may obtain a copy of the License at\n+ *\n+ *      http://www.apache.org/licenses/LICENSE-2.0\n+ *\n+ * Unless required by applicable law or agreed to in writing, software\n+ * distributed under the License is distributed on an \"AS IS\" BASIS,\n+ * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n+ * See the License for the specific language governing permissions and\n+ * limitations under the License.\n+ */\n+package org.apache.commons.math3.linear;\n+\n+/**\n+ * This interface defines a visitor for the entries of a vector. Visitors\n+ * implementing this interface do not alter the entries of the vector being\n+ * visited.\n+ *\n+ * @version $Id$\n+ * @since 3.1\n+ */\n+public interface RealVectorPreservingVisitor {\n+    /**\n+     * Start visiting a vector. This method is called once, before any entry\n+     * of the vector is visited.\n+     *\n+     * @param dimension the size of the vector\n+     * @param start the index of the first entry to be visited\n+     * @param end the index of the last entry to be visited (inclusive)\n+     */\n+    void start(int dimension, int start, int end);\n+\n+    /**\n+     * Visit one entry of the vector.\n+     *\n+     * @param index the index of the entry being visited\n+     * @param value the value of the entry being visited\n+     */\n+    void visit(int index, double value);\n+\n+    /**\n+     * End visiting a vector. This method is called once, after all entries of\n+     * the vector have been visited.\n+     *\n+     * @return the value that the {@code walkInXxxOrder} must return\n+     */\n+    // TODO Check above javadoc comment (add proper link to methods in\n+    // RealVector class)\n+    double end();\n+}", "timestamp": 1338191656, "metainfo": ""}