{"sha": "7a4800c229b498bd239a5d08187ecfd09268a1e5", "log": "Enhance plus/minus javadoc [3469522]", "commit": "\n--- a/src/main/java/org/joda/time/LocalDate.java\n+++ b/src/main/java/org/joda/time/LocalDate.java\n     /**\n      * Returns a copy of this date plus the specified number of years.\n      * <p>\n+     * This adds the specified number of years to the date.\n+     * If adding years makes the day-of-month invalid, it is adjusted to the last valid day in the month.\n      * This LocalDate instance is immutable and unaffected by this method call.\n      * <p>\n      * The following three lines are identical in effect:\n     /**\n      * Returns a copy of this date plus the specified number of months.\n      * <p>\n+     * This adds the specified number of months to the date.\n+     * The addition may change the year, but the day-of-month is normally unchanged.\n+     * If adding months makes the day-of-month invalid, it is adjusted to the last valid day in the month.\n      * This LocalDate instance is immutable and unaffected by this method call.\n      * <p>\n      * The following three lines are identical in effect:\n     /**\n      * Returns a copy of this date minus the specified number of years.\n      * <p>\n+     * This subtracts the specified number of years from the date.\n+     * If subtracting years makes the day-of-month invalid, it is adjusted to the last valid day in the month.\n      * This LocalDate instance is immutable and unaffected by this method call.\n      * <p>\n      * The following three lines are identical in effect:\n     /**\n      * Returns a copy of this date minus the specified number of months.\n      * <p>\n+     * This subtracts the specified number of months from the date.\n+     * The subtraction may change the year, but the day-of-month is normally unchanged.\n+     * If subtracting months makes the day-of-month invalid, it is adjusted to the last valid day in the month.\n      * This LocalDate instance is immutable and unaffected by this method call.\n      * <p>\n      * The following three lines are identical in effect:", "timestamp": 1325808399, "metainfo": ""}