{"sha": "8cff9bb7019d8ca65351541c7ab2346fb81aeedd", "log": "Improve javadoc of BasePeriod toDurationFrom() and toDurationTo()  ", "commit": "\n--- a/JodaTime/src/java/org/joda/time/base/BasePeriod.java\n+++ b/JodaTime/src/java/org/joda/time/base/BasePeriod.java\n     /**\n      * Gets the total millisecond duration of this period relative to a start instant.\n      * <p>\n-     * This method adds the period to the specifed instant.\n-     * The difference between the start instant and the result of the add is the duration\n+     * This method adds the period to the specifed instant in order to\n+     * calculate the duration.\n+     * <p>\n+     * An instant must be supplied as the duration of a period varies.\n+     * For example, a period of 1 month could vary between the equivalent of\n+     * 28 and 31 days in milliseconds due to different length months.\n+     * Similarly, a day can vary at Daylight Savings cutover, typically between\n+     * 23 and 25 hours.\n      *\n      * @param startInstant  the instant to add the period to, thus obtaining the duration\n      * @return the total length of the period as a duration relative to the start instant\n     }\n \n     /**\n-     * Gets the total millisecond duration of this period relative to an end instant.\n+     * Gets the total millisecond duration of this period relative to an\n+     * end instant.\n      * <p>\n-     * This method subtracts the period from the specifed instant.\n+     * This method subtracts the period from the specified instant in order\n+     * to calculate the duration.\n+     * <p>\n+     * An instant must be supplied as the duration of a period varies.\n+     * For example, a period of 1 month could vary between the equivalent of\n+     * 28 and 31 days in milliseconds due to different length months.\n+     * Similarly, a day can vary at Daylight Savings cutover, typically between\n+     * 23 and 25 hours.\n      *\n      * @param endInstant  the instant to subtract the period from, thus obtaining the duration\n      * @return the total length of the period as a duration relative to the end instant", "timestamp": 1187930047, "metainfo": ""}